[
  {
    "text": "NAME……………………………………………………………………….CLASS………………. COMPUTER SCIENCE FORM 6 MID TERM EXAMINATION 2025 SYLLABUS CODE 9618 PAPER 1 AND 3 THEORY FUNDAMENTALS TIME 1 HOUR 30 MINUTES DATE : Candidates answer on the question paper INSTRUCTIONS TO CANDIDATES 1.Write your name and class in the space at the top of this page. 2.Answer all the questions in the spaces provided. If additional space is required, you should use the lined page at the end of this question paper. The question number(s) must be clearly shown. 3.The use of an electronic calculator is not allowed 4.You are reminded of the need for clear presentation in your answers. 5.The number of marks is given in brackets [] at the end of each question or part question. Total Marks : 77 5 6 7 8 9 10",
    "marks": 5
  },
  {
    "text": "U6 COMPUTER SCIENCE 9618 PAPER 2 TEST 4 DATE : 14 MARCH 2025 4 6 7",
    "marks": 5
  },
  {
    "text": "FORM 3 COMPUTER SCIENCE TEST Answer all questions Date: 23 May 2025 Total: 50 Marks 30588 Lundi Drive, Rhodene, Masvingo, Zimbabwe Landline: +263 392 263 293 Cell: +263 78 604 4303 Email: info@juniorhighschool.ac.zw (c) Outline 4 stages of the program development life cycle ……………………………………………………………………………… ………………………………………………………………………………. ………………………………………………………………………………. …………………………………………………………………………….. ……………………………………………………………………………. [4] (b) 3 (a) (c ) Complete the following sentences using the most appropriate loop structure that matches the description(s) i A loop that is used when the number of repetitions is finite(limited)…………………………………………… ii A loop that checks the condition before execution………………………………………………………………………. iii A loop that checks the condition after execution ……………………………………………………………………[3] 5 7 A class of Computer Science has 30 students . a)Declare a 2D array Progress_Result to store the marks of the students for three consecutive terms in a particular year. ………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………[2] b) Write pseudo code algorithm to initialise the array using two nested loops. ……………………………………………………………………………………………………………………………………………………….. ………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………….[5] Total: 50 Marks",
    "marks": 20
  },
  {
    "text": "1 The text file HighScore.txt stores the players who have scored the top ten scores in a game,in descending order of score. The file stores the 3-character name of the player, and their integerscore, in the order: player, score.For example, the current top player in the text file:FYI is the player name10 000 is the scoreThe program:• reads in the data from HighScore.txt• allows the user to enter a new player name and their score• if appropriate, inserts the new player (name and score) into the top ten• writes the top ten players (name and score) into a new text file NewHighScore.txt(a) The program stores the players and their scores in an array of 11 elements (10 elements tobe read from the file, 1 element to be inserted by the user).Write a program to declare one or more arrays, as global data structures, to store the playernames and their scores.Save your program as Question1_J2022.Copy and paste the program code into part 1(a) in the evidence document.[2](b) The procedure ReadHighScores() opens the file HighScore.txt and reads the data intothe data structure(s) declared in part 1(a).Write program code to declare the procedure ReadHighScores() .Save your program.Copy and paste the program code into part 1(b) in the evidence document.[6",
    "marks": 5
  }
]